Revit.Elements.CurtainSystemType
A Revit CurtainSystemType

Revit.Elements.CurtainSystemType.InternalCurtainSystemType
An internal reference to the CurtainSystemType

Revit.Elements.CurtainSystemType.InternalElement
Reference to the Element

Revit.Elements.CurtainSystemType.#ctor(Autodesk.Revit.DB.CurtainSystemType)
Private constructor for the Element
CurtainSystemType:

Revit.Elements.CurtainSystemType.InitCurtainSystemType(Autodesk.Revit.DB.CurtainSystemType)
Initialize a CurtainSystemType element
CurtainSystemType:

Revit.Elements.CurtainSystemType.InternalSetCurtainSystemType(Autodesk.Revit.DB.CurtainSystemType)
Set the CurtainSystemType property, element id, and unique id
curtainSystemType:

Revit.Elements.CurtainSystemType.Name
The name of the CurtainSystemType

Revit.Elements.CurtainSystemType.ByName(System.String)
Select a CurtainSystemType from the document given
name:
Returns:

Revit.Elements.CurtainSystemType.FromExisting(Autodesk.Revit.DB.CurtainSystemType,System.Boolean)
Create a CurtainSystemType from a user selected Element.
CurtainSystemType:
isRevitOwned:
Returns: